# This file should be just list packages to install with apt
# Each package name should go on it's own line
# Lines starting with # are comments

# If a package needs a ppa to work, add it to the apt-ppas.list file
# Every ppa in that file will be added before any packages listed here are installed

# These are needed to allow apt to download packages over https
# by defauls, it uses http
software-properties-common
ca-certificates
apt-transport-https

appimagelauncher
backintime-qt4
# prefer firefox apt over snap as snap can't access yubikey
firefox
gnome-disk-utility
lynx
maven
neovim
pandoc
snapd
thefuck
zsh-antigen

# stuff for libre office (auto installs common parts)
libreoffice-writer
libreoffice-math

# stuff for ProtonVPN
openvpn
dialog
python3-pip
python3-setuptools

# stuff for docker
docker-ce
docker-ce-cli
containerd.io
